{
	"channel": 679771790506983509,
	"rules": {
		"accuracy": {
			"tag": "accuracy",
			"title": "Accuracy",
			"content": "This document is not guaranteed to always be up-to-date as the game rules are modified, however it is the duty of all players to keep this document accurate as game rules are modified. Where this document disagrees with the game rules, players must follow the game rules as they legally are, rather than their description in this document.",
			"parent_tag": "meta-rules",
			"child_tags": [],
			"message_ids": [
				681402728018214913
			]
		},
		"activity": {
			"tag": "activity",
			"title": "Activity",
			"content": "All players that have taken some game action in the preceding 72 hours are active players. All other players are inactive players.",
			"parent_tag": "root",
			"child_tags": [],
			"message_ids": [
				681402834972835860
			]
		},
		"bots": {
			"tag": "bots",
			"title": "Bots",
			"content": "Certain game functions may be performed automatically by automated \"bots\"; the behavior of such bots is not governed by the rules, and any function that bots may perform should be feasible, even if inconvenient, to do manually.",
			"parent_tag": "meta-rules",
			"child_tags": [],
			"message_ids": [
				681402752202833920
			]
		},
		"channels": {
			"tag": "channels",
			"title": "Channels",
			"content": "The game rules govern only messages and reactions in the \"Quonauts 7\" category of the Discord server. Each subsection of this rule section corresponds to a game channel; as these subsections are created, renamed, or reordered, game channels must be created/renamed/reordered accordingly.",
			"parent_tag": "root",
			"child_tags": [
				"general-channel",
				"rules-channel",
				"proposals-channel",
				"polls-channel",
				"transactions-channel",
				"land-channel"
			],
			"message_ids": [
				681402792350449674
			]
		},
		"closing-proposals": {
			"tag": "closing-proposals",
			"title": "Closing proposals",
			"content": "Any player may close an open proposal if one or more of the following conditions is met:\n\n* The proposal is at least 48 hours (2 days) old.\n* All active players have cast a vote on the proposal.\n* A majority of active players have voted in favour of the proposal.\n* A majority of active players have voted against the proposal.",
			"parent_tag": "proposals",
			"child_tags": [
				"passing-and-failing-proposals"
			],
			"message_ids": [
				681402857529933834
			]
		},
		"conflict-resolution": {
			"tag": "conflict-resolution",
			"title": "Conflict resolution",
			"content": "If multiple proposals describe the modification or addition of sections, paragraphs, or sentences to the same part of the rules, conflicts should be resolved based on the age of the proposal, such that the newer proposal's effect overrides the older one's. For example, if proposal #10 adds a new section \"A\" to the bottom of the rules, and proposal #11 adds a new section \"B\" to the bottom of the rules, and both proposals pass, then regardless of which proposal passed first, section \"B\" will appear below section \"A\" in the rules.",
			"parent_tag": "proposal-content",
			"child_tags": [],
			"message_ids": [
				681402837724692490
			]
		},
		"content": {
			"tag": "content",
			"title": "Content",
			"content": "* All rules should be written in English using proper English grammar and spelling. American and British English spelling are both acceptable.\n* Where applicable, rules should be written using gender-neutral language, with \"they/them/their\" as a third-person pronoun, both singular and plural.\n* Sentences should be separated by a single space.\n* Paragraphs should be separated by a blank line.\n* Each paragraph or list element must be shorter than 1000 characters.\n* Rules may not contain invisible characters besides newlines, normal spaces, and (in special cases) tabs. Non-ASCII characters should be used sparingly.\n* Double quotes should be preferred instead of single quotes. ASCII-compatible straight quotes should be used instead of \"smart\" quotes.",
			"parent_tag": "style-conventions",
			"child_tags": [],
			"message_ids": [
				681402770678349825
			]
		},
		"dependency-resolution": {
			"tag": "dependency-resolution",
			"title": "Dependency resolution",
			"content": "A proposal may state that it depends on other proposals. If a proposal's dependencies fail, then the proposal dependent on them also fails.\n\nA proposals may amend an existing proposal. If a proposal A amends an existing proposal B, then the amendment has no effect if B fails. If A and B both pass, then the result of proposal B is undone or modified according to proposal A. The content of proposal B, however, does not change.\n\nA proposal may also state incompatible proposals, in which case the later proposal will fail if any proposal it is incompatible proposal on is passed.",
			"parent_tag": "proposal-content",
			"child_tags": [],
			"message_ids": [
				681402838215032854
			]
		},
		"disallowed-by-default": {
			"tag": "disallowed-by-default",
			"title": "Disallowed by default",
			"content": "Unless explicitly stated in the rules, all game actions are forbidden.",
			"parent_tag": "meta-rules",
			"child_tags": [],
			"message_ids": [
				681402733256769544
			]
		},
		"editing-proposals": {
			"tag": "editing-proposals",
			"title": "Editing proposals",
			"content": "A player may edit a proposal they have submitted if that proposal is open for voting and has no votes cast by players other than its author.\n\nThe author of a proposal or the player passing a proposal may choose to add or remove whitespace and fix typos or grammer mistakes, as long as the meaning of the proposal remains unchanged. Clarifications or additional details should always be added by a new proposal.",
			"parent_tag": "proposals",
			"child_tags": [],
			"message_ids": [
				681402859044208687
			]
		},
		"equality": {
			"tag": "equality",
			"title": "Equality",
			"content": "All Players have exactly one vote for every proposal.\n\nThere is no way for a Player to gain additional votes.",
			"parent_tag": "root",
			"child_tags": [],
			"message_ids": [
				681402902702456870
			]
		},
		"errors": {
			"tag": "errors",
			"title": "Errors",
			"content": "An error is a rule violation made by a player either mistakenly or through ignorance. If a player causes a rule violation and is able to resolve the error, they may do so.\n\nIf a player resolves an error within 24 hours of making that error, and the resolution of the error leaves the game state in such fashion that it is as if the error had never occurred, no punitive action can be taken against the player.",
			"parent_tag": "rule-violations",
			"child_tags": [],
			"message_ids": [
				681402748218114070
			]
		},
		"formatting": {
			"tag": "formatting",
			"title": "Formatting",
			"content": "From [GitHub's \"Mastering Markdown\" document](https://guides.github.com/features/mastering-markdown/), the following may be used:\n\n* Emphasis (italics and bold, not including double underscore `__`)\n* Unordered and ordered lists (not nested)\n* Links\n* Inline code\n* Automatic linking for URLs\n* Strikethrough\n\nAdditionally, square brackets `[]` containing a tag will be converted into links to another rule section; e.g. `[%rule-tag]`. Discord mentions (@username, @role, and #channel) may be used, however they are not readable in GitHub-flavored markdown.",
			"parent_tag": "style-conventions",
			"child_tags": [],
			"message_ids": [
				681402774902145054
			]
		},
		"general-channel": {
			"tag": "general-channel",
			"title": "#general",
			"content": "Players may freely converse in the <#679771779589341218> channel.",
			"parent_tag": "channels",
			"child_tags": [],
			"message_ids": [
				681402792921006101
			]
		},
		"glossary": {
			"tag": "glossary",
			"title": "Glossary",
			"content": "The definitions for terms listed here take precedence over their normal English meanings, however any terms defined in a specific section of the rules override these in the section in which they are defined and any subsections of that section. A section may also define terms for use in the whole document.\n\n* **The Game**: The instance of Nomic which is governed by this rules document.\n* **Game Action**: A game action is any message or reaction in a game channel or any other manipulation of game channels or quantities which are part of the game.\n* **Game State**: A specific arrangement of all game rules, proposals, polls, votes and quantities.\n* **Game Channel**: A game channel is any text or voice channel listed in the \"Quonauts 7\" channel category of the Discord server.\n* **Player**: Any participant of the game.\n* **The Rules**: The rules of the game, which are described by this document.\n* **Section**: A part of the rules which is contained under one header, not including any subsections.\n* **Subsection**: A section of the rules which is contained under another section.\n* **Clause**: A single statement in the rules\n* **Limited scope** (of two clauses): The clause that applies in the least situations, having the most constraints.",
			"parent_tag": "meta-rules",
			"child_tags": [],
			"message_ids": [
				681402791587217443
			]
		},
		"headers-and-tags": {
			"tag": "headers-and-tags",
			"title": "Headers and tags",
			"content": "* Each section must have a header and a tag.\n* Headers must use [sentence case](https://en.wiktionary.org/wiki/sentence_case), and must be a short, succinct word or phrase (not a complete sentence) describing the section.\n* A section tag must be a string of text begin with a lowercase letter, end with either a lowercase letter or a number, and may contain only lowercase letters `a`-`z`, digits `0`-`9`, and hyphens `-`.\n* A rule's tag should resemble its header.\n* Tags must be unique; no two rule sections may have the same tag.",
			"parent_tag": "style-conventions",
			"child_tags": [],
			"message_ids": [
				681402771852754954
			]
		},
		"land": {
			"tag": "land",
			"title": "Land",
			"content": "The Land is an infinite square lattice. A 'land tile' is a point of this lattice, and has corresponding coordinates and a type (number associated with a string). Every pair of integer coordinates has a corresponding land tile.\n\n'land-x' and 'land-y' are quantities. A player with (land-x, land-y) matching the coordinates of a certain land tile 'resides' in that land tile.\n\n'North' and 'South' respectively correspond to the positive and negative y-axis, and 'East' and 'West' respectively to the positive and negative x-axis.",
			"parent_tag": "root",
			"child_tags": [
				"land-movement",
				"land-generation"
			],
			"message_ids": [
				681402881705902082
			]
		},
		"land-channel": {
			"tag": "land-channel",
			"title": "#the-land",
			"content": "Players must announce their movement through The Land in <#680403819699765285>, and their announcements must match their actual movements.",
			"parent_tag": "channels",
			"child_tags": [],
			"message_ids": [
				681402814576328705
			]
		},
		"land-generation": {
			"tag": "land-generation",
			"title": "Land generation",
			"content": "By default, a land tile has type 'empty', or 0. A land tile with type 0 and a player residing in it changes its type to 'grass', or 1.",
			"parent_tag": "land",
			"child_tags": [],
			"message_ids": [
				681402900492320836
			]
		},
		"land-movement": {
			"tag": "land-movement",
			"title": "Land movement",
			"content": "Subject to a 12-hour cooldown, a player may add or subtract 1 from one of their coordinates.",
			"parent_tag": "land",
			"child_tags": [],
			"message_ids": [
				681402882821586954
			]
		},
		"lists": {
			"tag": "lists",
			"title": "Lists",
			"content": "* Unordered lists should use a single asterisk followed by a space (`* `) before each list element.\n* Ordered lists should use a single number followed by a period and a space (`1. `) before each list element.\n* The numbers of a ordered list should start at `1` and increase by `1` for each element.\n* Lists should not be nested.\n* Lists should be separated by the paragraphs above and below by a blank line.\n* Two lists of the same type can not be adjacent. (This is treated as one list when converted to Markdown.)\n\nWithin a given list, all elements should have the same style, chosen from the following:\n\n* Elements are words or phrases, and do not end with a period.\n* Elements are clauses ending in a period (or other punctuation), and optionally followed by complete sentences.\n* Elements are complete sentences ending in a period, and optionally followed by more complete sentences.",
			"parent_tag": "style-conventions",
			"child_tags": [],
			"message_ids": [
				681402773870608425
			]
		},
		"meta-rules": {
			"tag": "meta-rules",
			"title": "Meta rules",
			"content": "This section details how the rules are to be applied to the game.",
			"parent_tag": "root",
			"child_tags": [
				"accuracy",
				"precedence",
				"disallowed-by-default",
				"rule-violations",
				"timezones",
				"bots",
				"style-conventions",
				"glossary"
			],
			"message_ids": [
				681402726126846034
			]
		},
		"monarch": {
			"tag": "monarch",
			"title": "Monarch",
			"content": "One player carries the title of \"Monarch\" (or \"King\" or \"Queen\", if preferred), chosen by election (see %royal-election).",
			"parent_tag": "root",
			"child_tags": [
				"royal-election"
			],
			"message_ids": [
				681402901490696192
			]
		},
		"passing-and-failing-proposals": {
			"tag": "passing-and-failing-proposals",
			"title": "Passing and failing proposals",
			"content": "When a proposal is closed, it passes if it has more votes in favour than against; otherwise, it fails.\n\nThe player that authored a proposal may fail or delete it at any time.\n\nWhen a player passes a proposal, that player must carry out the effects of that proposal and its passing to the best of their ability.",
			"parent_tag": "closing-proposals",
			"child_tags": [],
			"message_ids": [
				681402858494885903
			]
		},
		"polls-channel": {
			"tag": "polls-channel",
			"title": "#polls",
			"content": "A poll is a means of gathering the opinions of players on an issue. Players may conduct a poll by providing any necessary detail and posting a question in the <#679771811004809282> game channel.\n\nPlayers may vote in favor of a poll by reacting to the poll with 👍. Players may vote against a poll by reacting to the poll with 👎.\n\nThe player that posted a poll may edit it freely, as long as such edits do not change the meaning/intent of any existing reactions to the poll.",
			"parent_tag": "channels",
			"child_tags": [],
			"message_ids": [
				681402813015654437
			]
		},
		"precedence": {
			"tag": "precedence",
			"title": "Precedence",
			"content": "1. If one clause has a more limited scope than another, then the clause with the more limited scope takes precedence.\n2. The clause which appears last in the rules takes precedence.",
			"parent_tag": "meta-rules",
			"child_tags": [],
			"message_ids": [
				681402730815946806
			]
		},
		"proposal-content": {
			"tag": "proposal-content",
			"title": "Proposal content",
			"content": "A proposal can describe any number of actions that make changes to the game rules or otherwise alter the game state.\n\nIf a proposal describes a modification to the rules, it must unambiguously specify the rule section(s) to be modified and how they will be modified.\n\nIf a proposal describes the creation of a new rule section, it must specify its title, its location in relation to an existing one, and its content.",
			"parent_tag": "proposals",
			"child_tags": [
				"conflict-resolution",
				"dependency-resolution"
			],
			"message_ids": [
				681402837036564501
			]
		},
		"proposals": {
			"tag": "proposals",
			"title": "Proposals",
			"content": "Proposals can be made by posting them to the <#679771801773277357> game channel.\n\nThe first proposal is numbered #1 and each subsequent proposal's number is increased by 1. Deleted proposals retain their number.\n\nA proposal is either open or closed. When it is first submitted a proposal is open. A closed proposal is either passed or failed. When a player closes a proposal, they must either pass it or fail it.",
			"parent_tag": "root",
			"child_tags": [
				"proposal-content",
				"voting-on-proposals",
				"closing-proposals",
				"editing-proposals"
			],
			"message_ids": [
				681402836046577692
			]
		},
		"proposals-channel": {
			"tag": "proposals-channel",
			"title": "#proposals",
			"content": "The <#679771801773277357> channel is governed by [%proposals].",
			"parent_tag": "channels",
			"child_tags": [],
			"message_ids": [
				681402794615636020
			]
		},
		"punitive-action": {
			"tag": "punitive-action",
			"title": "Punitive action",
			"content": "If a player (hereby \"the convicted player\") is convicted of violating the rules, another player may conduct a poll (called a \"punitive action poll\") to determine whether punitive action should be taken.\n\nPlayers should vote in favour of this poll only if they believe the convicted player violated the rules knowingly and with malicious intent.\n\nAny vote in such a poll cast by the convicted player is not counted.\n\nA punitive action poll must be available for voting for at least 24 hours before any action may be taken as a result.\n\nIf a punitive action poll passes, then the convicted player gains one strike.",
			"parent_tag": "rule-violations",
			"child_tags": [],
			"message_ids": [
				681402749958619148
			]
		},
		"purchase": {
			"tag": "purchase",
			"title": "Purchase",
			"content": "A Purchase is a voluntary transaction of any two quantities between any two Players.\n\nA Purchase must be agreed on by both Players performing the Purchase to be Complete.\n\nOnce a purchase is Complete, the Quantities must be exchanged according to the agreement.\n\nA Complete Purchase cannot be revoked or undone in any way.\n\nAn Invalid Purchase does not allow an exchange.\n\nAny Purchase in which the Quantities being exchanged is not explicitly stated before the Purchase is Complete is Invalid.\n\nAny Purchase in which the amount of Quantities being exchanged is not explicitly stated before the Purchase is Complete is Invalid.",
			"parent_tag": "quantities",
			"child_tags": [],
			"message_ids": [
				681402878803312644
			]
		},
		"quantities": {
			"tag": "quantities",
			"title": "Quantities",
			"content": "A quantity is a named property with a numerical value for each player.\n\nBy default any unique quantity added to the game:\n• applies to all players.\n• is instantiated at zero.\n• must always be an integer.\n• must never have a negative value.\n\nQuantities may be traded or exchanged in ways specifically allowed by the rules.\n\nThe following quantities exist:\n\n* **Strike**: The number of rule violations a player has committed.\n* **Point**: The number of points a player has scored.",
			"parent_tag": "root",
			"child_tags": [
				"purchase"
			],
			"message_ids": [
				681402859866292227
			]
		},
		"roles": {
			"tag": "roles",
			"title": "Roles",
			"content": "The game rules govern roles that have effect within the game.",
			"parent_tag": "root",
			"child_tags": [
				"rule-offender"
			],
			"message_ids": [
				681402815570247740
			]
		},
		"root": {
			"tag": "root",
			"title": null,
			"content": null,
			"parent_tag": null,
			"child_tags": [
				"meta-rules",
				"channels",
				"roles",
				"activity",
				"proposals",
				"quantities",
				"winning",
				"the-end",
				"land",
				"monarch",
				"equality"
			],
			"message_ids": [
				681402904245960742,
				681402921924952130,
				681402922680057891
			]
		},
		"royal-election": {
			"tag": "royal-election",
			"title": "Royal election",
			"content": "A new monarch is chosen by a poll, called a \"Royal election\", with all active players as candidates (unless they explicitly declare they are not a candidate). The election ends when\n* 48 hours have passed since start of the poll\n* all active players have cast a vote\n* one candidate has gained an absolute majority of votes\nWhen one of these occurs, the election is immediately over and no more votes may be cast in the poll. If then one player has the most votes, they become the new monarch. Otherwise, a new election begins.",
			"parent_tag": "monarch",
			"child_tags": [],
			"message_ids": [
				681402902169780235
			]
		},
		"rule-offender": {
			"tag": "rule-offender",
			"title": "Rule offender",
			"content": "Any player which has 1 or more strikes gains the \"Rule offender\" role. Rule offenders may not perform any game actions; i.e. they may not participate in the game. After 24 hours, a players strike count will decrease by 1 if above 0. If a players strike count is 0, the role will be removed.",
			"parent_tag": "roles",
			"child_tags": [],
			"message_ids": [
				681402816471760957
			]
		},
		"rule-violation-polls": {
			"tag": "rule-violation-polls",
			"title": "Rule violation polls",
			"content": "If any player (hereby \"the accusing player\") believes that another player (hereby \"the accused player\") has violated the rules, then the accusing player may conduct a poll (called a \"rule violation poll\") to determine whether the accused player has violated the rules.\n\nIn conducting a rule violation poll, the accusing player must describe which sections or clauses of the rules were violated and what illegal game action was taken by the accused player. Players should vote in favor of this poll only if they agree that the accused player violated the rules as described.\n\nAny vote in such a poll cast by the accused player is not counted.\n\nA rule violation poll must be available for voting for at least 24 hours before any action may be taken as a result.\n\nA rule violation poll may not be started more than 7 days after the potential rule violation.\n\nFor any potential rule violation, only one rule violation poll may be conducted.\n\nIf a rule violation poll passes, then the accused player is now convicted of violating the rules as described in the poll and the rule violation must be resolved, if it has not already.",
			"parent_tag": "rule-violations",
			"child_tags": [],
			"message_ids": [
				681402749136404489
			]
		},
		"rule-violations": {
			"tag": "rule-violations",
			"title": "Rule violations",
			"content": "A rule violation is a game action that is not permitted by the rules. Resolving a rule violation is the process of reversing the immediate effects of that rule violation (not including any indirect effects permitted in reaction to the rule violation) to the extent that it is possible.",
			"parent_tag": "meta-rules",
			"child_tags": [
				"errors",
				"rule-violation-polls",
				"punitive-action"
			],
			"message_ids": [
				681402734800666624
			]
		},
		"rules-channel": {
			"tag": "rules-channel",
			"title": "#rules",
			"content": "The <#679771790506983509> channel contains this rules document.",
			"parent_tag": "channels",
			"child_tags": [],
			"message_ids": [
				681402793856204881
			]
		},
		"style-conventions": {
			"tag": "style-conventions",
			"title": "Style conventions",
			"content": "This section and its subsections describe grammatical and stylistic conventions used throughout this ruleset.\n\nAny player may edit the rules to conform to these style conventions. Edits made this way must otherwise be minimal; i.e. they may not change wording or meaning.",
			"parent_tag": "meta-rules",
			"child_tags": [
				"content",
				"headers-and-tags",
				"lists",
				"formatting"
			],
			"message_ids": [
				681402769579704321
			]
		},
		"the-end": {
			"tag": "the-end",
			"title": "The end",
			"content": "The game ends if a player has won.",
			"parent_tag": "root",
			"child_tags": [],
			"message_ids": [
				681402881228013573
			]
		},
		"timezones": {
			"tag": "timezones",
			"title": "Timezones",
			"content": "Unless otherwise specified, all times and dates are specified with respect to UTC.",
			"parent_tag": "meta-rules",
			"child_tags": [],
			"message_ids": [
				681402750768119851
			]
		},
		"transactions-channel": {
			"tag": "transactions-channel",
			"title": "#transactions",
			"content": "The <#679774549273084061> channel may be used to modify quantities, but only as the game rules allow quantities to be changed.",
			"parent_tag": "channels",
			"child_tags": [],
			"message_ids": [
				681402814026743810
			]
		},
		"voting-on-proposals": {
			"tag": "voting-on-proposals",
			"title": "Voting on proposals",
			"content": "Each player may cast one vote on each open proposal.\n\nPlayers may vote for or against a proposal. Players may also explicitly abstain from voting.\n\nA player may change their vote on an open proposal at any time.",
			"parent_tag": "proposals",
			"child_tags": [],
			"message_ids": [
				681402856448065546
			]
		},
		"winning": {
			"tag": "winning",
			"title": "Winning",
			"content": "A player can win the game if a rule says so. A proposal cannot directly lead to a player winning. The game cannot be won by more than one player. If according to a rule two or more players win at the same time, that rule does not apply.",
			"parent_tag": "root",
			"child_tags": [],
			"message_ids": [
				681402880024248347
			]
		}
	}
}